OpenDTEF-v2012/tutorials/multiphase/interFoam/laminar/waves/waveMakerPiston/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom1
    {
        type            zeroGradient;
    }

    bottom2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    leftwall
    {
        type            waveMaker;
        value           uniform (0 0 0);

        motionType      piston;
        n               (1 0 0);
        waveHeight      0.06;
        initialDepth    0.25;
        wavePeriod      2.0;
        rampTime        2.0;
        wavePhase       0;
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }

    rightwall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    top
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
